/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 50619
Source Host           : 127.0.0.1:3306
Source Database       : message_center

Target Server Type    : MYSQL
Target Server Version : 50619
File Encoding         : 65001

Date: 2015-02-13 11:56:30
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for apps
-- ----------------------------
DROP TABLE IF EXISTS `apps`;
CREATE TABLE `apps` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `project_name` varchar(32) NOT NULL,
  `user` varchar(32) NOT NULL,
  `gmt_create` datetime NOT NULL,
  `user_phone` varchar(16) NOT NULL,
  `gmt_modified` datetime NOT NULL,
  `category_id` varchar(16) NOT NULL,
  `over_plus` bigint(20) NOT NULL,
  `user_name` varchar(32) NOT NULL,
  `password` varchar(32) NOT NULL,
  `max_length` int(11) NOT NULL,
  `deleted` tinyint(1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=1005 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of apps
-- ----------------------------
INSERT INTO `apps` VALUES ('1001', 'test', 'test', '2015-02-11 09:27:44', '15168381275', '2015-02-11 09:27:52', '10001', '100', 'admin', '25d55ad283aa400af464c76d713c07ad', '10', '0');
INSERT INTO `apps` VALUES ('1002', 'project', 'admin', '2015-02-13 11:22:16', '151', '2015-02-13 11:22:16', '10001', '1', 'admin', '1234', '1', '0');
INSERT INTO `apps` VALUES ('1003', 'project', 'admin', '2015-02-13 11:24:04', '151', '2015-02-13 11:24:04', '10001', '1', 'admin', '1234', '1', '0');
INSERT INTO `apps` VALUES ('1004', 'project', 'admin', '2015-02-13 11:24:33', '151', '2015-02-13 11:24:33', '10001', '1', 'admin', '1234', '1', '1');

-- ----------------------------
-- Table structure for app_rules
-- ----------------------------
DROP TABLE IF EXISTS `app_rules`;
CREATE TABLE `app_rules` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `app_id` bigint(20) NOT NULL,
  `frequency_type` tinyint(1) NOT NULL,
  `max` bigint(20) NOT NULL,
  `gmt_create` datetime NOT NULL,
  `gmt_modified` datetime NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of app_rules
-- ----------------------------
INSERT INTO `app_rules` VALUES ('1', '1001', '3', '100', '2015-02-12 11:57:38', '2015-02-12 11:57:40');

-- ----------------------------
-- Table structure for category
-- ----------------------------
DROP TABLE IF EXISTS `category`;
CREATE TABLE `category` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `category_name` varchar(32) NOT NULL,
  `gmt_create` datetime NOT NULL,
  `gmt_modified` datetime NOT NULL,
  `deleted` tinyint(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10002 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of category
-- ----------------------------
INSERT INTO `category` VALUES ('10001', '信息科', '2015-02-13 10:30:08', '2015-02-13 10:30:10', '0');

-- ----------------------------
-- Table structure for message_detail
-- ----------------------------
DROP TABLE IF EXISTS `message_detail`;
CREATE TABLE `message_detail` (
  `id` bigint(20) NOT NULL,
  `content` varchar(1024) NOT NULL,
  `rece_number` varchar(16) NOT NULL,
  `send_date` datetime NOT NULL,
  `send_status` tinyint(2) NOT NULL,
  `callback_status` tinyint(2) NOT NULL,
  `error_msg` varchar(32) DEFAULT NULL,
  `category_id` varchar(16) NOT NULL,
  `app_id` bigint(20) NOT NULL,
  `user_id` varchar(32) NOT NULL,
  `gmt_create` datetime NOT NULL,
  `gmt_modified` datetime NOT NULL,
  `counts` int(11) NOT NULL,
  `callback_time` varchar(16) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of message_detail
-- ----------------------------
INSERT INTO `message_detail` VALUES ('602', '短信内容', '15115671375', '2015-02-10 15:07:30', '0', '0', null, '1098801', '1001', 'admin', '2015-02-10 15:07:30', '2015-02-10 15:07:30', '0', null);
INSERT INTO `message_detail` VALUES ('4002', '星期几测试', '15115671377', '2015-02-11 13:13:22', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:13:22', '2015-02-11 13:13:22', '1', null);
INSERT INTO `message_detail` VALUES ('4003', '星期几测试', '15115671378', '2015-02-11 13:13:22', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:13:22', '2015-02-11 13:13:22', '1', null);
INSERT INTO `message_detail` VALUES ('4004', '星期几测试', '15115671379', '2015-02-11 13:13:22', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:13:22', '2015-02-11 13:13:22', '1', null);
INSERT INTO `message_detail` VALUES ('4005', '星期几测试', '15115671382', '2015-02-11 13:13:22', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:13:22', '2015-02-11 13:13:22', '1', null);
INSERT INTO `message_detail` VALUES ('4006', '星期几测试', '15115671383', '2015-02-11 13:13:22', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:13:22', '2015-02-11 13:13:22', '1', null);
INSERT INTO `message_detail` VALUES ('4007', '星期几测试', '15115671380', '2015-02-11 13:13:22', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:13:22', '2015-02-11 13:13:22', '1', null);
INSERT INTO `message_detail` VALUES ('4008', '星期几测试', '15115671375', '2015-02-11 13:13:22', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:13:22', '2015-02-11 13:13:22', '1', null);
INSERT INTO `message_detail` VALUES ('4009', '星期几测试', '15115671381', '2015-02-11 13:13:23', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:13:23', '2015-02-11 13:13:23', '1', null);
INSERT INTO `message_detail` VALUES ('4010', '星期几测试', '15115671376', '2015-02-11 13:13:23', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:13:23', '2015-02-11 13:13:23', '1', null);
INSERT INTO `message_detail` VALUES ('4011', '星期几测试', '15115671384', '2015-02-11 13:13:23', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:13:23', '2015-02-11 13:13:23', '1', null);
INSERT INTO `message_detail` VALUES ('4302', '星期几测试', '15115671377', '2015-02-11 13:17:20', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:17:29', '2015-02-11 13:17:29', '1', null);
INSERT INTO `message_detail` VALUES ('4303', '星期几测试', '15115671378', '2015-02-11 13:17:29', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:17:29', '2015-02-11 13:17:29', '1', null);
INSERT INTO `message_detail` VALUES ('4304', '星期几测试', '15115671379', '2015-02-11 13:17:29', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:17:29', '2015-02-11 13:17:29', '1', null);
INSERT INTO `message_detail` VALUES ('4305', '星期几测试', '15115671382', '2015-02-11 13:17:29', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:17:29', '2015-02-11 13:17:29', '1', null);
INSERT INTO `message_detail` VALUES ('4306', '星期几测试', '15115671383', '2015-02-11 13:17:29', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:17:29', '2015-02-11 13:17:29', '1', null);
INSERT INTO `message_detail` VALUES ('4307', '星期几测试', '15115671380', '2015-02-11 13:17:29', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:17:29', '2015-02-11 13:17:29', '1', null);
INSERT INTO `message_detail` VALUES ('4308', '星期几测试', '15115671375', '2015-02-11 13:17:29', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:17:29', '2015-02-11 13:17:29', '1', null);
INSERT INTO `message_detail` VALUES ('4309', '星期几测试', '15115671381', '2015-02-11 13:17:29', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:17:29', '2015-02-11 13:17:29', '1', null);
INSERT INTO `message_detail` VALUES ('4310', '星期几测试', '15115671376', '2015-02-11 13:17:29', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:17:29', '2015-02-11 13:17:29', '1', null);
INSERT INTO `message_detail` VALUES ('4311', '星期几测试', '15115671384', '2015-02-11 13:17:29', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:17:29', '2015-02-11 13:17:29', '1', null);
INSERT INTO `message_detail` VALUES ('4702', '星期几测试', '15115671377', '2015-02-11 13:25:37', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:25:37', '2015-02-11 13:25:37', '1', null);
INSERT INTO `message_detail` VALUES ('4703', '星期几测试', '15115671378', '2015-02-11 13:25:37', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:25:37', '2015-02-11 13:25:37', '1', null);
INSERT INTO `message_detail` VALUES ('4704', '星期几测试', '15115671379', '2015-02-11 13:25:37', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:25:37', '2015-02-11 13:25:37', '1', null);
INSERT INTO `message_detail` VALUES ('4705', '星期几测试', '15115671382', '2015-02-11 13:25:37', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:25:37', '2015-02-11 13:25:37', '1', null);
INSERT INTO `message_detail` VALUES ('4706', '星期几测试', '15115671383', '2015-02-11 13:25:37', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:25:37', '2015-02-11 13:25:37', '1', null);
INSERT INTO `message_detail` VALUES ('4707', '星期几测试', '15115671380', '2015-02-11 13:25:37', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:25:37', '2015-02-11 13:25:37', '1', null);
INSERT INTO `message_detail` VALUES ('4708', '星期几测试', '15115671375', '2015-02-11 13:25:37', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:25:37', '2015-02-11 13:25:37', '1', null);
INSERT INTO `message_detail` VALUES ('4709', '星期几测试', '15115671381', '2015-02-11 13:25:37', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:25:37', '2015-02-11 13:25:37', '1', null);
INSERT INTO `message_detail` VALUES ('4710', '星期几测试', '15115671376', '2015-02-11 13:25:37', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:25:37', '2015-02-11 13:25:37', '1', null);
INSERT INTO `message_detail` VALUES ('4711', '星期几测试', '15115671384', '2015-02-11 13:25:37', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:25:37', '2015-02-11 13:25:37', '1', null);
INSERT INTO `message_detail` VALUES ('4902', '星期几测试', '15115671377', '2015-02-11 13:28:32', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:28:32', '2015-02-11 13:28:32', '1', null);
INSERT INTO `message_detail` VALUES ('4903', '星期几测试', '15115671378', '2015-02-11 13:28:32', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:28:32', '2015-02-11 13:28:32', '1', null);
INSERT INTO `message_detail` VALUES ('4904', '星期几测试', '15115671379', '2015-02-11 13:28:32', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:28:32', '2015-02-11 13:28:32', '1', null);
INSERT INTO `message_detail` VALUES ('4905', '星期几测试', '15115671382', '2015-02-11 13:28:32', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:28:32', '2015-02-11 13:28:32', '1', null);
INSERT INTO `message_detail` VALUES ('4906', '星期几测试', '15115671383', '2015-02-11 13:28:32', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:28:32', '2015-02-11 13:28:32', '1', null);
INSERT INTO `message_detail` VALUES ('4907', '星期几测试', '15115671380', '2015-02-11 13:28:32', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:28:32', '2015-02-11 13:28:32', '1', null);
INSERT INTO `message_detail` VALUES ('4908', '星期几测试', '15115671375', '2015-02-11 13:28:32', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:28:32', '2015-02-11 13:28:32', '1', null);
INSERT INTO `message_detail` VALUES ('4909', '星期几测试', '15115671381', '2015-02-11 13:28:32', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:28:32', '2015-02-11 13:28:32', '1', null);
INSERT INTO `message_detail` VALUES ('4910', '星期几测试', '15115671376', '2015-02-11 13:28:32', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:28:32', '2015-02-11 13:28:32', '1', null);
INSERT INTO `message_detail` VALUES ('4911', '星期几测试', '15115671384', '2015-02-11 13:28:32', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:28:32', '2015-02-11 13:28:32', '1', null);
INSERT INTO `message_detail` VALUES ('5102', '星期几测试', '15115671377', '2015-02-11 13:56:24', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:56:24', '2015-02-11 13:56:24', '1', null);
INSERT INTO `message_detail` VALUES ('5103', '星期几测试', '15115671378', '2015-02-11 13:56:24', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:56:24', '2015-02-11 13:56:24', '1', null);
INSERT INTO `message_detail` VALUES ('5104', '星期几测试', '15115671379', '2015-02-11 13:56:24', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:56:24', '2015-02-11 13:56:24', '1', null);
INSERT INTO `message_detail` VALUES ('5105', '星期几测试', '15115671382', '2015-02-11 13:56:24', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:56:24', '2015-02-11 13:56:24', '1', null);
INSERT INTO `message_detail` VALUES ('5106', '星期几测试', '15115671383', '2015-02-11 13:56:24', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:56:24', '2015-02-11 13:56:24', '1', null);
INSERT INTO `message_detail` VALUES ('5107', '星期几测试', '15115671380', '2015-02-11 13:56:24', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:56:24', '2015-02-11 13:56:24', '1', null);
INSERT INTO `message_detail` VALUES ('5108', '星期几测试', '15115671375', '2015-02-11 13:56:24', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:56:24', '2015-02-11 13:56:24', '1', null);
INSERT INTO `message_detail` VALUES ('5109', '星期几测试', '15115671381', '2015-02-11 13:56:24', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:56:24', '2015-02-11 13:56:24', '1', null);
INSERT INTO `message_detail` VALUES ('5110', '星期几测试', '15115671376', '2015-02-11 13:56:24', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:56:24', '2015-02-11 13:56:24', '1', null);
INSERT INTO `message_detail` VALUES ('5111', '星期几测试', '15115671384', '2015-02-11 13:56:24', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 13:56:24', '2015-02-11 13:56:24', '1', null);
INSERT INTO `message_detail` VALUES ('5302', '星期几测试', '15115671377', '2015-02-11 13:58:22', '-1', '0', '8', '100001', '1001', 'admin', '2015-02-11 13:58:22', '2015-02-11 13:58:22', '1', null);
INSERT INTO `message_detail` VALUES ('5303', '星期几测试', '15115671378', '2015-02-11 13:58:22', '-1', '0', '8', '100001', '1001', 'admin', '2015-02-11 13:58:22', '2015-02-11 13:58:22', '1', null);
INSERT INTO `message_detail` VALUES ('5304', '星期几测试', '15115671379', '2015-02-11 13:58:23', '-1', '0', '8', '100001', '1001', 'admin', '2015-02-11 13:58:23', '2015-02-11 13:58:23', '1', null);
INSERT INTO `message_detail` VALUES ('5305', '星期几测试', '15115671382', '2015-02-11 13:58:23', '-1', '0', '8', '100001', '1001', 'admin', '2015-02-11 13:58:23', '2015-02-11 13:58:23', '1', null);
INSERT INTO `message_detail` VALUES ('5306', '星期几测试', '15115671383', '2015-02-11 13:58:23', '-1', '0', '8', '100001', '1001', 'admin', '2015-02-11 13:58:23', '2015-02-11 13:58:23', '1', null);
INSERT INTO `message_detail` VALUES ('5307', '星期几测试', '15115671380', '2015-02-11 13:58:23', '-1', '0', '8', '100001', '1001', 'admin', '2015-02-11 13:58:23', '2015-02-11 13:58:23', '1', null);
INSERT INTO `message_detail` VALUES ('5308', '星期几测试', '15115671375', '2015-02-11 13:58:23', '-1', '0', '8', '100001', '1001', 'admin', '2015-02-11 13:58:23', '2015-02-11 13:58:23', '1', null);
INSERT INTO `message_detail` VALUES ('5309', '星期几测试', '15115671381', '2015-02-11 13:58:23', '-1', '0', '8', '100001', '1001', 'admin', '2015-02-11 13:58:23', '2015-02-11 13:58:23', '1', null);
INSERT INTO `message_detail` VALUES ('5310', '星期几测试', '15115671376', '2015-02-11 13:58:23', '-1', '0', '8', '100001', '1001', 'admin', '2015-02-11 13:58:23', '2015-02-11 13:58:23', '1', null);
INSERT INTO `message_detail` VALUES ('5311', '星期几测试', '15115671384', '2015-02-11 13:58:23', '-1', '0', '8', '100001', '1001', 'admin', '2015-02-11 13:58:23', '2015-02-11 13:58:23', '1', null);
INSERT INTO `message_detail` VALUES ('5502', '星期几测试', '15115671377', '2015-02-11 14:04:11', '-1', '0', '8', '100001', '1001', 'admin', '2015-02-11 14:04:11', '2015-02-11 14:04:11', '1', null);
INSERT INTO `message_detail` VALUES ('5503', '星期几测试', '15115671378', '2015-02-11 14:04:11', '-1', '0', '8', '100001', '1001', 'admin', '2015-02-11 14:04:11', '2015-02-11 14:04:11', '1', null);
INSERT INTO `message_detail` VALUES ('5504', '星期几测试', '15115671379', '2015-02-11 14:04:11', '-1', '0', '8', '100001', '1001', 'admin', '2015-02-11 14:04:11', '2015-02-11 14:04:11', '1', null);
INSERT INTO `message_detail` VALUES ('5505', '星期几测试', '15115671382', '2015-02-11 14:04:11', '-1', '0', '8', '100001', '1001', 'admin', '2015-02-11 14:04:11', '2015-02-11 14:04:11', '1', null);
INSERT INTO `message_detail` VALUES ('5506', '星期几测试', '15115671383', '2015-02-11 14:04:11', '-1', '0', '8', '100001', '1001', 'admin', '2015-02-11 14:04:11', '2015-02-11 14:04:11', '1', null);
INSERT INTO `message_detail` VALUES ('5507', '星期几测试', '15115671380', '2015-02-11 14:04:12', '-1', '0', '8', '100001', '1001', 'admin', '2015-02-11 14:04:12', '2015-02-11 14:04:12', '1', null);
INSERT INTO `message_detail` VALUES ('5508', '星期几测试', '15115671375', '2015-02-11 14:04:12', '-1', '0', '8', '100001', '1001', 'admin', '2015-02-11 14:04:12', '2015-02-11 14:04:12', '1', null);
INSERT INTO `message_detail` VALUES ('5509', '星期几测试', '15115671381', '2015-02-11 14:04:12', '-1', '0', '8', '100001', '1001', 'admin', '2015-02-11 14:04:12', '2015-02-11 14:04:12', '1', null);
INSERT INTO `message_detail` VALUES ('5510', '星期几测试', '15115671376', '2015-02-11 14:04:12', '-1', '0', '8', '100001', '1001', 'admin', '2015-02-11 14:04:12', '2015-02-11 14:04:12', '1', null);
INSERT INTO `message_detail` VALUES ('5511', '星期几测试', '15115671384', '2015-02-11 14:04:12', '-1', '0', '8', '100001', '1001', 'admin', '2015-02-11 14:04:12', '2015-02-11 14:04:12', '1', null);
INSERT INTO `message_detail` VALUES ('5702', '星期几测试', '15115671377', '2015-02-11 14:09:26', '-1', '0', '161', '100001', '1001', 'admin', '2015-02-11 14:09:26', '2015-02-11 14:09:26', '1', null);
INSERT INTO `message_detail` VALUES ('5703', '星期几测试', '15115671378', '2015-02-11 14:09:26', '-1', '0', '161', '100001', '1001', 'admin', '2015-02-11 14:09:26', '2015-02-11 14:09:26', '1', null);
INSERT INTO `message_detail` VALUES ('5704', '星期几测试', '15115671379', '2015-02-11 14:09:26', '-1', '0', '161', '100001', '1001', 'admin', '2015-02-11 14:09:26', '2015-02-11 14:09:26', '1', null);
INSERT INTO `message_detail` VALUES ('5705', '星期几测试', '15115671382', '2015-02-11 14:09:26', '-1', '0', '161', '100001', '1001', 'admin', '2015-02-11 14:09:26', '2015-02-11 14:09:26', '1', null);
INSERT INTO `message_detail` VALUES ('5706', '星期几测试', '15115671383', '2015-02-11 14:09:26', '-1', '0', '161', '100001', '1001', 'admin', '2015-02-11 14:09:26', '2015-02-11 14:09:26', '1', null);
INSERT INTO `message_detail` VALUES ('5707', '星期几测试', '15115671380', '2015-02-11 14:09:26', '-1', '0', '161', '100001', '1001', 'admin', '2015-02-11 14:09:26', '2015-02-11 14:09:26', '1', null);
INSERT INTO `message_detail` VALUES ('5708', '星期几测试', '15115671375', '2015-02-11 14:09:26', '-1', '0', '161', '100001', '1001', 'admin', '2015-02-11 14:09:26', '2015-02-11 14:09:26', '1', null);
INSERT INTO `message_detail` VALUES ('5709', '星期几测试', '15115671381', '2015-02-11 14:09:27', '-1', '0', '161', '100001', '1001', 'admin', '2015-02-11 14:09:27', '2015-02-11 14:09:27', '1', null);
INSERT INTO `message_detail` VALUES ('5710', '星期几测试', '15115671376', '2015-02-11 14:09:27', '-1', '0', '161', '100001', '1001', 'admin', '2015-02-11 14:09:27', '2015-02-11 14:09:27', '1', null);
INSERT INTO `message_detail` VALUES ('5711', '星期几测试', '15115671384', '2015-02-11 14:09:27', '-1', '0', '161', '100001', '1001', 'admin', '2015-02-11 14:09:27', '2015-02-11 14:09:27', '1', null);
INSERT INTO `message_detail` VALUES ('5902', '星期几测试', '15115671377', '2015-02-11 14:11:22', '-1', '0', '161', '100001', '1001', 'admin', '2015-02-11 14:11:22', '2015-02-11 14:11:22', '1', null);
INSERT INTO `message_detail` VALUES ('5903', '星期几测试', '15115671378', '2015-02-11 14:11:22', '-1', '0', '161', '100001', '1001', 'admin', '2015-02-11 14:11:22', '2015-02-11 14:11:22', '1', null);
INSERT INTO `message_detail` VALUES ('5904', '星期几测试', '15115671379', '2015-02-11 14:11:22', '-1', '0', '161', '100001', '1001', 'admin', '2015-02-11 14:11:22', '2015-02-11 14:11:22', '1', null);
INSERT INTO `message_detail` VALUES ('5905', '星期几测试', '15115671382', '2015-02-11 14:11:22', '-1', '0', '161', '100001', '1001', 'admin', '2015-02-11 14:11:22', '2015-02-11 14:11:22', '1', null);
INSERT INTO `message_detail` VALUES ('5906', '星期几测试', '15115671383', '2015-02-11 14:11:22', '-1', '0', '161', '100001', '1001', 'admin', '2015-02-11 14:11:22', '2015-02-11 14:11:22', '1', null);
INSERT INTO `message_detail` VALUES ('5907', '星期几测试', '15115671380', '2015-02-11 14:11:22', '-1', '0', '161', '100001', '1001', 'admin', '2015-02-11 14:11:22', '2015-02-11 14:11:22', '1', null);
INSERT INTO `message_detail` VALUES ('5908', '星期几测试', '15115671375', '2015-02-11 14:11:22', '-1', '0', '161', '100001', '1001', 'admin', '2015-02-11 14:11:22', '2015-02-11 14:11:22', '1', null);
INSERT INTO `message_detail` VALUES ('5909', '星期几测试', '15115671381', '2015-02-11 14:11:22', '-1', '0', '161', '100001', '1001', 'admin', '2015-02-11 14:11:22', '2015-02-11 14:11:22', '1', null);
INSERT INTO `message_detail` VALUES ('5910', '星期几测试', '15115671376', '2015-02-11 14:11:22', '-1', '0', '161', '100001', '1001', 'admin', '2015-02-11 14:11:22', '2015-02-11 14:11:22', '1', null);
INSERT INTO `message_detail` VALUES ('5911', '星期几测试', '15115671384', '2015-02-11 14:11:22', '-1', '0', '161', '100001', '1001', 'admin', '2015-02-11 14:11:22', '2015-02-11 14:11:22', '1', null);
INSERT INTO `message_detail` VALUES ('6102', '星期几测试', '15115671377', '2015-02-11 14:16:07', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 14:16:08', '2015-02-11 14:16:08', '1', null);
INSERT INTO `message_detail` VALUES ('6103', '星期几测试', '15115671378', '2015-02-11 14:16:08', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 14:16:08', '2015-02-11 14:16:08', '1', null);
INSERT INTO `message_detail` VALUES ('6104', '星期几测试', '15115671379', '2015-02-11 14:16:08', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 14:16:08', '2015-02-11 14:16:08', '1', null);
INSERT INTO `message_detail` VALUES ('6105', '星期几测试', '15115671382', '2015-02-11 14:16:08', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 14:16:08', '2015-02-11 14:16:08', '1', null);
INSERT INTO `message_detail` VALUES ('6106', '星期几测试', '15115671383', '2015-02-11 14:16:08', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 14:16:08', '2015-02-11 14:16:08', '1', null);
INSERT INTO `message_detail` VALUES ('6107', '星期几测试', '15115671380', '2015-02-11 14:16:08', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 14:16:08', '2015-02-11 14:16:08', '1', null);
INSERT INTO `message_detail` VALUES ('6108', '星期几测试', '15115671375', '2015-02-11 14:16:08', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 14:16:08', '2015-02-11 14:16:08', '1', null);
INSERT INTO `message_detail` VALUES ('6109', '星期几测试', '15115671381', '2015-02-11 14:16:08', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 14:16:08', '2015-02-11 14:16:08', '1', null);
INSERT INTO `message_detail` VALUES ('6110', '星期几测试', '15115671376', '2015-02-11 14:16:08', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 14:16:08', '2015-02-11 14:16:08', '1', null);
INSERT INTO `message_detail` VALUES ('6111', '星期几测试', '15115671384', '2015-02-11 14:16:08', '0', '0', null, '100001', '1001', 'admin', '2015-02-11 14:16:08', '2015-02-11 14:16:08', '1', null);
INSERT INTO `message_detail` VALUES ('6902', 'fafdsaff', '15168381275', '2015-02-11 15:53:48', '0', '0', null, '10001', '1001', 'admin', '2015-02-11 15:53:48', '2015-02-11 15:53:48', '1', null);
INSERT INTO `message_detail` VALUES ('7102', 'fafdsaff', '15168381275', '2015-02-11 16:39:36', '0', '0', null, '10001', '1001', 'admin', '2015-02-11 16:39:36', '2015-02-11 16:39:36', '1', null);

-- ----------------------------
-- Table structure for sequence
-- ----------------------------
DROP TABLE IF EXISTS `sequence`;
CREATE TABLE `sequence` (
  `name` varchar(20) NOT NULL,
  `value` bigint(20) NOT NULL,
  `gmt_modified` datetime NOT NULL,
  PRIMARY KEY (`name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of sequence
-- ----------------------------
INSERT INTO `sequence` VALUES ('message_id', '10001', '2015-02-13 11:39:31');

-- ----------------------------
-- Table structure for template
-- ----------------------------
DROP TABLE IF EXISTS `template`;
CREATE TABLE `template` (
  `id` bigint(20) NOT NULL AUTO_INCREMENT,
  `NAME` varchar(32) NOT NULL,
  `TEMPLATE_STR` varchar(512) NOT NULL,
  `PARAM_LIST` varchar(512) NOT NULL,
  `PROJECT_ID` bigint(20) NOT NULL,
  `GMT_CREATE` datetime NOT NULL,
  `GMT_MODIFIED` datetime NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of template
-- ----------------------------
INSERT INTO `template` VALUES ('1', 'template', 'fafdsaf$!{bb}', 'bb', '1001', '2015-02-11 09:52:50', '2015-02-11 09:52:53');
